import React from "react";
import { ScrollView } from "react-native";
import styled from "styled-components";
import Text from "../components/Text";

export default terms = () => {
  // the user can see the terms for using the app
  return (
    <ScrollView>
      <Container>
        <Main>
          <Text left>
            תקנון השימוש באפליקציה הנ"ל נכתב בלשון זכר אך האמור בו מתייחס לנשים
            וגברים כאחד.
          </Text>
        </Main>

        <Terms>
          <TermsTitle large>קדימון</TermsTitle>
          <TermsContent>
            אפליקציה iCheck (להלן "האפליקציה") היא אפליקציה המשתמש כאפליקציה
            (אפליקציה לניהול חשבוניות) ייצוגי עבור iCheck והנך מוזמן לקחת בו חלק
            בכפוף להסכמתך לתנאי השימוש אשר יפורטו להלן בנוסף השימוש באפליקציה זה
            על כל תכניו והשירותים המוצעים בו, הורדות של קבצים, מדיה כגון תמונות
            וסרטונים והתכנים השונים המוצעים לקהל המבקרים עשויים להשתנות מעת לעת
            או בהתאם לסוג התוכן. הנהלת האפליקציה שומרת לעצמה הזכות לעדכן את תנאי
            השימוש המוצגים להלן מעת לעת וללא התראה או אזכור מיוחד בערוצי
            האפליקציה השונים.
          </TermsContent>

          <TermsTitle>קניין רוחני</TermsTitle>
          <TermsContent>
            האפליקציה כמו גם כל המידע שבו לרבות עיצוב האפליקציה, קוד האפליקציה,
            קבצי מדיה לרבות גרפיקות, סרטונים, תמונות, טקסטים, קבצים המוצעים
            להורדה וכל חומר אחר אשר מוצג באפליקציה שייכים במלואם לאפליקציה הנ"ל
            ומהווים קניין רוחני בלעדי של אפליקציה iCheck ואין לעשות בהם שימוש
            ללא אישור כתוב מראש מאפליקציה iCheck. בנוסף אין להפיץ, להעתיק,
            לשכפל, לפרסם, לחקות או לעבד פיסות קוד, גרפיקות, סרטונים, סימנים
            מסחריים או כל מדיה ותוכן אחר מבלי שיש ברשותכם אישור כתוב מראש.
          </TermsContent>

          <TermsTitle>תוכן האפליקציה</TermsTitle>
          <TermsContent>
            אנו שואפים לספק לכם את המידע המוצג באפליקציה ללא הפרעות אך יתכנו בשל
            שיקולים טכניים, תקלות צד ג או אחרים, הפרעות בזמינות האפליקציה. ולכן
            איננו יכולים להתחייב כי האפליקציה יהיה זמין לכם בכל עת ולא יינתן כל
            פיצוי כספי או אחר בשל הפסקת השירות / הורדת האפליקציה.{"\n"}
            קישורים לאפליקציה חיצוניים אינם מהווים ערובה כי מדובר באפליקציהים
            בטוחים, איכותיים או אמינים וביקור בהם נעשה על דעתכם האישית בלבד
            ונמצאים בתחום האחריות הבלעדי של המשתמש באפליקציה. התכנים המוצעים
            באפליקציה הינם בבעלותם הבלעדית של iCheck ואין לעשות בהם שימוש אשר
            נועד את האמור בתקנון זה (ראה סעיף 3) למעט במקרים בהם צוין אחרת או
            במקרים בהם צוין כי זכויות היוצרים שייכים לגוף חיצוני. במקרים אלו יש
            לבדוק מהם תנאי השימוש בקישור המצורף ולפעול על פי המצוין באפליקציה
            החיצוני לו שייכים התכנים.
          </TermsContent>

          <TermsTitle>ניהול משתמשים ומבקרים באפליקציה</TermsTitle>
          <TermsContent>
            הנהלת האפליקציה שומרת לעצמה את הזכות לחסום כל משתמש ובין אם על ידי
            חסימת כתובת הIP של המחשב שלו, כתובת הMACID של המחשב שלו או אפילו
            בהתאם למדינת המוצא ללא צורך לספק תירוץ אשר מקובל על הגולש. צוות
            האפליקציה יעשה כל שביכולתו להגן על פרטי המשתמשים הרשומים באפליקציה /
            מנויים הרשומים באפליקציה. במקרים בהם יעלה בידיו של צד שלישי להשיג
            גישה למידע מוסכם בזאת כי לגולשים, משתמשים וחברים באפליקציה לה תהה כל
            תביעה, טענה או דרישה כלפי צוות האפליקציה iCheck.
          </TermsContent>

          <TermsTitle>גילוי נאות</TermsTitle>
          <TermsContent>
            באפליקציה זה עשוי לעשות שימוש בקבצי קוקיז (במיוחד עבור משתמשים
            רשומים ומנויים) ובממשקי סטטיסטיקה פנימיים בכדי לשמור תיעוד סטטיסטי
            אנונימי של גולשים וניתוח תנועת הגולש/ים, הרגלי גלישה באפליקציה
            וניתוח קליקים וזמן שהייה.
            {"\n"}
            בכל העת ולבד מאשר גולשים המחוברים לאפליקציה המידע הנשמר הוא אנונימי
            לחלוטין ואין בו את שם הגולש או כל פרט מזהה אחר.
          </TermsContent>

          <TermsTitle>איזור שיפוט</TermsTitle>
          <TermsContent>
            בעת שאתם עושים שימוש באפליקציה ובמקרה בו התגלעה כל מחולקת אתם
            מסכימים להלן כי האמור לעיל נמצא תחת סמכות השיפוט הבלעדי של החוק
            הישראלי תוך שימוש במערכת בתי המשפט הישראליים בלבד במחוז באר שבע.
          </TermsContent>
        </Terms>
      </Container>
    </ScrollView>
  );
};

const Container = styled.View`
  flex: 1;
`;

const Main = styled.View`
  margin: 20px;
`;

const Terms = styled.View``;

const TermsTitle = styled(Text)`
  color: #8e93a1;
  font-size: 16px;
  font-weight: 500;
  text-align: left;
  margin: 10px;
`;

const TermsContent = styled(Text)`
  font-size: 14px;
  font-weight: 300;
  text-align: left;
  padding: 10px;
  background-color: #ffffff;
`;
